
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Бронирование") Тогда
		// Заполнение шапки
		ДокументОснование=ДанныеЗаполнения.Ссылка;
		ДатаНачала = ДанныеЗаполнения.ДатаНачала;
		ДатаОкончания = ДанныеЗаполнения.ДатаОкончания;
		Клиент = ДанныеЗаполнения.Клиент;
		КоличествоМест = ДанныеЗаполнения.КоличествоМест;
		НомерОтеля = ДанныеЗаполнения.НомерОтеля;
		Организация = ДанныеЗаполнения.Организация;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	ТекДата =ДатаНачала;
	Движения.СостоянияНомеров.Записывать = Истина;
	Пока ТекДата<=ДатаОкончания Цикл
		Движение = Движения.СостоянияНомеров.Добавить();
		Движение.НомерОтеля = НомерОтеля;
		Движение.Дата = ТекДата;
		Движение.Период=Дата;
		Движение.КоличествоМест = КоличествоМест;
		Движение.Состояние=Перечисления.СостояниеНомера.ПустаяСсылка();
		ТекДата = ТекДата + 60 * 60 * 24; 
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

