
&НаСервереБезКонтекста
Процедура Номер1НачалоВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Номер1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Номер1НачалоВыбораНаСервере();
КонецПроцедуры

&НаСервере
Процедура РасчетСтоимостиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦенаСуточногоПроживанияСрезПоследних.Цена КАК Цена
			|ИЗ
			|	РегистрСведений.ЦенаСуточногоПроживания.СрезПоследних(&Дата, КласНомера = &Класс) КАК ЦенаСуточногоПроживанияСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Класс", Объект.НомерОтеля.КлассНомера);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Цена=ВыборкаДетальныеЗаписи.Цена;
	Если Цена=0 Тогда
		СП=Новый СообщениеПользователю;
		СП.Текст="НЕ ВВедена цена на этот номер!Стоимость не будет посчитана!" ;
		СП.Сообщить();
	КонецЕсли;
	КолДней=Окр((Объект.ДатаОкончания-Объект.ДатаНачала)/86400,0)+1;
	Объект.СтоимостьПроживания=Объект.КоличествоМест*Цена*КолДней;
	Если Объект.Клиент.ИмеетСкидку Тогда
		Скидка= Объект.КоличествоМест*Цена*КолДней*Объект.Клиент.ПроцентСкидки/100;
		Объект.СтоимостьПроживанияСоСкидкой=Объект.СтоимостьПроживания-Скидка;
	Иначе
		 Объект.СтоимостьПроживанияСоСкидкой=Объект.СтоимостьПроживания;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасчетСтоимости(Команда)
	РасчетСтоимостиНаСервере();
КонецПроцедуры
