
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Бронирование") Тогда
		// Заполнение шапки
		ДатаНачала = ДанныеЗаполнения.ДатаНачала;
		ДатаОкончания = ДанныеЗаполнения.ДатаОкончания;
		Клиент = ДанныеЗаполнения.Клиент;
		КоличествоМест = ДанныеЗаполнения.КоличествоМест;
		НомерОтеля = ДанныеЗаполнения.НомерОтеля;
		Организация = ДанныеЗаполнения.Организация;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
Процедура РасчетСтоимостиПроживания()
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦенаСуточногоПроживанияСрезПоследних.Цена КАК Цена
			|ИЗ
			|	РегистрСведений.ЦенаСуточногоПроживания.СрезПоследних(&Дата, КласНомера = &Класс) КАК ЦенаСуточногоПроживанияСрезПоследних";
	Запрос.УстановитьПараметр("Дата", ДатаНачала);
	Запрос.УстановитьПараметр("Класс", НомерОтеля.КлассНомера);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Цена=ВыборкаДетальныеЗаписи.Цена;
	Если Цена=0 Тогда
		СП=Новый СообщениеПользователю;
		СП.Текст="НЕ ВВедена цена на этот номер!Стоимость не будет посчитана!" ;
		СП.Сообщить();
	КонецЕсли;
	КолДней=Окр((ДатаОкончания-ДатаНачала)/86400,0)+1;
	СтоимостьПроживания=КоличествоМест*Цена*КолДней;
	Если Клиент.ИмеетСкидку Тогда
		Скидка= КоличествоМест*Цена*КолДней*Клиент.ПроцентСкидки/100;
		СтоимостьПроживанияСоСкидкой=СтоимостьПроживания-Скидка;
	Иначе
		 СтоимостьПроживанияСоСкидкой=СтоимостьПроживания;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	  	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(НомерОтеля) тогда
	РасчетСтоимостиПроживания();
	Если СтоимостьПроживания=0 Тогда
		СП=Новый СообщениеПользователю;
		СП.Текст="Стоимость НЕ посчитана!" ;
		СП.Сообщить();
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Процедура ОбработкаПроведения(Отказ, Режим)
	ТекДата =ДатаНачала;
	Движения.СостоянияНомеров.Записывать = Истина;
	Пока ТекДата<=ДатаОкончания Цикл
		Движение = Движения.СостоянияНомеров.Добавить();
		Движение.НомерОтеля = НомерОтеля;
		Движение.Дата = ТекДата;
		Движение.Период=Дата;
		Движение.КоличествоМест = КоличествоМест;
		Движение.Состояние=Перечисления.СостояниеНомера.Занят;
		ТекДата = ТекДата + 60 * 60 * 24; 
	КонецЦикла;
	Если ДокументОснование.ДатаОкончания > ДатаОкончания Тогда
		ТекДата =ДатаОкончания;
		Пока ТекДата < ДокументОснование.ДатаОкончания Цикл
			Движение = Движения.СостоянияНомеров.Добавить();
			Движение.НомерОтеля = НомерОтеля;
			Движение.Дата = ТекДата;
		    Движение.Период=Дата;
			Движение.КоличествоМест = КоличествоМест;
			Движение.Состояние=Перечисления.СостояниеНомера.Свободен;
			ТекДата = ТекДата + 60 * 60 * 24; 
		КонецЦикла;
	КонецЕсли;
	//Движения.Проживающие.Записывать=Истина;
	//Движение=Движения.Проживающие.Добавить();
	//Движение.Номер=НомерОтеля;
	//Движение.Клиент=Клиент;
	//Движение.ДатаНач=ДатаНачала;
	//Движение.ДатаКон=ДатаОкончания;
	//Движение.Сумма=СтоимостьПроживанияСоСкидкой;
	//Движение.Период=Дата;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
