

&НаКлиенте
Процедура НомерОтеляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	   СтандартнаяОбработка=Ложь;
	    Отбор=Новый Структура;
	
	Отбор.Вставить("МоментВремени",ТекущаяДата());
	Отбор.Вставить("ДатаНач",Объект.ДатаНачала);
	Отбор.Вставить("ДатаКон",Объект.ДатаОкончания);
	ОткрытьФорму("Справочник.Номера.ФормаВыбора",Отбор,ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ЭтаФорма.Объект.НомерОтеля=ВыбранноеЗначение;
КонецПроцедуры
