
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Момент",Параметры.МоментВремени);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНач", Параметры.ДатаНач);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаКон", Параметры.ДатаКон);
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Сообщить("Выбор");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
  ОповеститьОВыборе(Элемент.ТекущиеДанные.Наименование);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Сообщить("Обработка выбора");
КонецПроцедуры


