
Процедура ОбработкаПроведения(Отказ, Режим)
	ТекДата =ДатаНачала;
	Движения.СостоянияНомеров.Записывать = Истина;
	Пока ТекДата<=ДатаОкончания Цикл
		Движение = Движения.СостоянияНомеров.Добавить();
		Движение.НомерОтеля = НомерОтеля;
		Движение.Дата = ТекДата;
		Движение.Период=Дата;
		Движение.КоличествоМест = КоличествоМест;
		Движение.Состояние=Перечисления.СостояниеНомера.Бронь;
		ТекДата = ТекДата + 60 * 60 * 24; 
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры



