
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыбытиеГостя") Тогда
		// Заполнение шапки
		ДокументОснование=ДанныеЗаполнения.Ссылка;
		Клиент = ДанныеЗаполнения.Клиент;
		Организация = ДанныеЗаполнения.Организация;
		СуммаВозврата = ДанныеЗаполнения.СтоимостьПроживанияРанее-ДанныеЗаполнения.СтоимостьПроживания;
		СуммаВозвратаСоСкидкой=ДанныеЗаполнения.СтоимостьПроживанияСоСкидкойРанее-ДанныеЗаполнения.СтоимостьПроживанияСоСкидкой;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Оплаты 
	Движения.Оплаты.Записывать = Истина;
	Движение = Движения.Оплаты.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	
	Движение.Сумма = -СуммаВозврата;
    Движение.СуммаСоСкидкой = -СуммаВозвратаСоСкидкой;
    
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
